RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_rcu.h
/* RCU_APB3EN */
#define RCU_APB3EN_TLIEN                BIT(0)                                      /*!< TLI enable */
#define RCU_APB3EN_WWDGTEN              BIT(1)                                      /*!< WWDGT enable */

/* RCU_APB4EN */
#define RCU_APB4EN_SYSCFGEN             BIT(0)                                      /*!< SYSCFG enable */
#define RCU_APB4EN_CMPEN                BIT(1)                                      /*!< CMP enable */
#define RCU_APB4EN_VREFEN               BIT(2)                                      /*!< VREF enable */
#define RCU_APB4EN_LPDTSEN              BIT(3)                                      /*!< LPDTS enable */
#define RCU_APB4EN_PMUEN                BIT(4)                                      /*!< PMU enable */

/* RCU_AHB1SPEN */
#define RCU_AHB1SPEN_ENET1SPEN          BIT(0)                                      /*!< ENET1 clock enable when sleep mode*/
#define RCU_AHB1SPEN_ENET1TXSPEN        BIT(1)                                      /*!< ENET1 TX clock enable when sleep mode*/
#define RCU_AHB1SPEN_ENET1RXSPEN        BIT(2)                                      /*!< ENET1 RX clock enable when sleep mode*/
#define RCU_AHB1SPEN_ENET1PTPSPEN       BIT(3)                                      /*!< ENET1 PTP clock enable when sleep mode */
#define RCU_AHB1SPEN_USBHS0SPEN         BIT(14)                                     /*!< USBHS0 clock enable when sleep mode */
#define RCU_AHB1SPEN_USBHS0ULPISPEN     BIT(15)                                     /*!< USBHS0ULPI clock enable when sleep mode */
#define RCU_AHB1SPEN_SRAM0SPEN          BIT(16)                                     /*!< SRAM0 clock enable when sleep mode */
#define RCU_AHB1SPEN_SRAM1SPEN          BIT(17)                                     /*!< SRAM1 clock enable when sleep mode */
#define RCU_AHB1SPEN_DMA0SPEN           BIT(21)                                     /*!< DMA0 clock enable when sleep mode*/
#define RCU_AHB1SPEN_DMA1SPEN           BIT(22)                                     /*!< DMA1 clock enable when sleep mode*/
#define RCU_AHB1SPEN_DMAMUXSPEN         BIT(23)                                     /*!< DMAMUX clock enable when sleep mode*/
#define RCU_AHB1SPEN_ENET0SPEN          BIT(25)                                     /*!< ENET0 clock enable when sleep mode*/
#define RCU_AHB1SPEN_ENET0TXSPEN        BIT(26)                                     /*!< ENET0 TX clock enable when sleep mode*/
#define RCU_AHB1SPEN_ENET0RXSPEN        BIT(27)                                     /*!< ENET0 RX clock enable when sleep mode*/
#define RCU_AHB1SPEN_ENET0PTPSPEN       BIT(28)                                     /*!< ENET0 PTP clock enable when sleep mode*/
#define RCU_AHB1SPEN_USBHS1SPEN         BIT(29)                                     /*!< USBHS1 clock enable when sleep mode*/
#define RCU_AHB1SPEN_USBHS1ULPISPEN     BIT(30)                                     /*!< USBHS1 ULPI clock enable when sleep mode*/

/* RCU_AHB2SPEN */
#define RCU_AHB2SPEN_DCISPEN            BIT(0)                                      /*!< DCI clock enable when sleep mode*/
#define RCU_AHB2SPEN_FACSPEN            BIT(1)                                      /*!< FAC clock enable when sleep mode*/
#define RCU_AHB2SPEN_SDIO1SPEN          BIT(2)                                      /*!< SDIO1 clock enable when sleep mode*/
#define RCU_AHB2SPEN_CAUSPEN            BIT(3)                                      /*!< CAU clock enable when sleep mode*/
#define RCU_AHB2SPEN_HAUSPEN            BIT(4)                                      /*!< HAU clock enable when sleep mode*/
#define RCU_AHB2SPEN_TRNGSPEN           BIT(6)                                      /*!< TRNG clock enable when sleep mode*/
#define RCU_AHB2SPEN_TMUSPEN            BIT(7)                                      /*!< TMU clock enable when sleep mode*/
#define RCU_AHB2SPEN_RAMECCMU1SPEN      BIT(8)                                      /*!< RAMECCMU1 clock enable when sleep mode*/

/* RCU_AHB3SPEN */
#define RCU_AHB3SPEN_EXMCSPEN           BIT(0)                                      /*!< EXMC clock enable when sleep mode*/
#define RCU_AHB3SPEN_IPASPEN            BIT(1)                                      /*!< IPA clock enable when sleep mode*/
#define RCU_AHB3SPEN_SDIO0SPEN          BIT(2)                                      /*!< SDIO0 clock enable when sleep mode*/
#define RCU_AHB3SPEN_MDMASPEN           BIT(3)                                      /*!< MDMA clock enable when sleep mode*/
#define RCU_AHB3SPEN_OSPIMSPEN          BIT(4)                                      /*!< OSPIM clock enable when sleep mode*/
#define RCU_AHB3SPEN_OSPI0SPEN          BIT(5)                                      /*!< OSPI0 clock enable when sleep mode*/
#define RCU_AHB3SPEN_OSPI1SPEN          BIT(6)                                      /*!< OSPI1 clock enable when sleep mode*/
#define RCU_AHB3SPEN_RTDEC0SPEN         BIT(8)                                      /*!< RTDEC0 clock enable when sleep mode*/
#define RCU_AHB3SPEN_RTDEC1SPEN         BIT(9)                                      /*!< RTDEC1 clock enable when sleep mode*/
#define RCU_AHB2SPEN_RAMECCMU0SPEN      BIT(10)                                     /*!< RAMECCMU0 clock enable when sleep mode*/
#define RCU_AHB3SPEN_AXISRAMSPEN        BIT(14)                                     /*!< AXISRAM clock enable when sleep mode*/
#define RCU_AHB3SPEN_FMCSPEN            BIT(15)                                     /*!< FMC clock enable when sleep mode*/

/* RCU_AHB4SPEN */
#define RCU_AHB4SPEN_PASPEN             BIT(0)                                      /*!< GPIO port A clock enable when sleep mode*/
#define RCU_AHB4SPEN_PBSPEN             BIT(1)                                      /*!< GPIO port B clock enable when sleep mode*/
#define RCU_AHB4SPEN_PCSPEN             BIT(2)                                      /*!< GPIO port C clock enable when sleep mode*/
#define RCU_AHB4SPEN_PDSPEN             BIT(3)                                      /*!< GPIO port D clock enable when sleep mode*/
#define RCU_AHB4SPEN_PESPEN             BIT(4)                                      /*!< GPIO port E clock enable when sleep mode*/
#define RCU_AHB4SPEN_PFSPEN             BIT(5)                                      /*!< GPIO port F clock enable when sleep mode*/
#define RCU_AHB4SPEN_PGSPEN             BIT(6)                                      /*!< GPIO port G clock enable when sleep mode*/
#define RCU_AHB4SPEN_PHSPEN             BIT(7)                                      /*!< GPIO port H clock enable when sleep mode*/
#define RCU_AHB4SPEN_PJSPEN             BIT(8)                                      /*!< GPIO port J clock enable when sleep mode*/
#define RCU_AHB4SPEN_PKSPEN             BIT(9)                                      /*!< GPIO port K clock enable when sleep mode*/
#define RCU_AHB4SPEN_BKPSRAMSPEN        BIT(13)                                     /*!< BKPSRAMEN clock enable when sleep mode*/
#define RCU_AHB4SPEN_CRCSPEN            BIT(14)                                     /*!< CRC clock enable when sleep mode*/

/* RCU_APB1SPEN */
#define RCU_APB1SPEN_TIMER1SPEN         BIT(0)                                      /*!< TIMER1 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER2SPEN         BIT(1)                                      /*!< TIMER2 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER3SPEN         BIT(2)                                      /*!< TIMER3 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER4SPEN         BIT(3)                                      /*!< TIMER4 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER5SPEN         BIT(4)                                      /*!< TIMER5 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER6SPEN         BIT(5)                                      /*!< TIMER6 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER22SPEN        BIT(6)                                      /*!< TIMER22 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER23SPEN        BIT(7)                                      /*!< TIMER23 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER30SPEN        BIT(8)                                      /*!< TIMER30 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER31SPEN        BIT(9)                                      /*!< TIMER31 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER50SPEN        BIT(10)                                     /*!< TIMER50 clock enable when sleep mode*/
#define RCU_APB1SPEN_TIMER51SPEN        BIT(11)                                     /*!< TIMER51 clock enable when sleep mode*/
#define RCU_APB1SPEN_RSPDIFSPEN         BIT(13)                                     /*!< RSPDIF clock enable when sleep mode*/
#define RCU_APB1SPEN_SPI1SPEN           BIT(14)                                     /*!< SPI1 clock enable when sleep mode*/
#define RCU_APB1SPEN_SPI2SPEN           BIT(15)                                     /*!< SPI2 clock enable when sleep mode*/
#define RCU_APB1SPEN_MDIOSPEN           BIT(16)                                     /*!< MDIO clock enable when sleep mode*/
#define RCU_APB1SPEN_USART1SPEN         BIT(17)                                     /*!< USART1 clock enable when sleep mode*/
#define RCU_APB1SPEN_USART2SPEN         BIT(18)                                     /*!< USART2 clock enable when sleep mode*/
#define RCU_APB1SPEN_UART3SPEN          BIT(19)                                     /*!< UART3 clock enable when sleep mode*/
#define RCU_APB1SPEN_UART4SPEN          BIT(20)                                     /*!< UART4 clock enable when sleep mode*/
#define RCU_APB1SPEN_I2C0SPEN           BIT(21)                                     /*!< I2C0 clock enable when sleep mode*/
#define RCU_APB1SPEN_I2C1SPEN           BIT(22)                                     /*!< I2C1 clock enable when sleep mode*/
#define RCU_APB1SPEN_I2C2SPEN           BIT(23)                                     /*!< I2C2 clock enable when sleep mode*/
#define RCU_APB1SPEN_I2C3SPEN           BIT(24)                                     /*!< I2C3 clock enable when sleep mode*/
#define RCU_APB1SPEN_CTCSPEN            BIT(27)                                     /*!< CTC clock enable when sleep mode*/
#define RCU_APB1SPEN_DACHOLDSPEN        BIT(28)                                     /*!< DAC hold clock enable when sleep mode*/
#define RCU_APB1SPEN_DACSPEN            BIT(29)                                     /*!< DAC clock enable when sleep mode*/
#define RCU_APB1SPEN_UART6SPEN          BIT(30)                                     /*!< UART6 clock enable when sleep mode*/
#define RCU_APB1SPEN_UART7SPEN          BIT(31)                                     /*!< UART7 clock enable when sleep mode*/

