RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_rcu.h
/* clock stabilization and failure and peripheral reset flags */
typedef enum {
    /* clock stabilization flags */
    RCU_FLAG_IRC64MSTB     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 31U),                   /*!< IRC64M stabilization flags */
    RCU_FLAG_HXTALSTB      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 17U),                   /*!< HXTAL stabilization flags */
    RCU_FLAG_PLL0STB       = RCU_REGIDX_BIT(CTL_REG_OFFSET, 25U),                   /*!< PLL0 stabilization flags */
    RCU_FLAG_PLL1STB       = RCU_REGIDX_BIT(CTL_REG_OFFSET, 27U),                   /*!< PLL1 stabilization flags */
    RCU_FLAG_PLL2STB       = RCU_REGIDX_BIT(CTL_REG_OFFSET, 29U),                   /*!< PLL2 stabilization flags */
    RCU_FLAG_LXTALSTB      = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 1U),                  /*!< LXTAL stabilization flags */
    RCU_FLAG_IRC32KSTB     = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 1U),                 /*!< IRC32K stabilization flags */
    RCU_FLAG_IRC48MSTB     = RCU_REGIDX_BIT(ADDCTL0_REG_OFFSET, 17U),               /*!< IRC48M stabilization flags */
    RCU_FLAG_LPIRC4MSTB    = RCU_REGIDX_BIT(ADDCTL1_REG_OFFSET, 1U),                /*!< LPIRC4M stabilization flags */
    RCU_FLAG_PLLUSBHS0STB  = RCU_REGIDX_BIT(ADDCTL1_REG_OFFSET, 29U),               /*!< PLLUSBHS0 stabilization flags */
    RCU_FLAG_PLLUSBHS1STB  = RCU_REGIDX_BIT(ADDCTL1_REG_OFFSET, 31U),               /*!< PLLUSBHS1 stabilization flags */
    /* clock failure flag */
    RCU_FLAG_LCKMD         = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 6U),                  /*!< LXTAL clock failure detection flags */
    /* reset source flags */
    RCU_FLAG_BORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 25U),                /*!< BOR reset flags */
    RCU_FLAG_EPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 26U),                /*!< External PIN reset flags */
    RCU_FLAG_PORRST        = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 27U),                /*!< power reset flags */
    RCU_FLAG_SWRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 28U),                /*!< Software reset flags */
    RCU_FLAG_FWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 29U),                /*!< FWDGT reset flags */
    RCU_FLAG_WWDGTRST      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 30U),                /*!< WWDGT reset flags */
    RCU_FLAG_LPRST         = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 31U)                 /*!< low-power reset flags */
} rcu_flag_enum;

/* clock stabilization and stuck interrupt flags */
typedef enum {
    RCU_INT_FLAG_IRC32KSTB      = RCU_REGIDX_BIT(INT_REG_OFFSET, 0U),               /*!< IRC32K stabilization interrupt flag */
    RCU_INT_FLAG_LXTALSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 1U),               /*!< LXTAL stabilization interrupt flag */
    RCU_INT_FLAG_IRC64MSTB      = RCU_REGIDX_BIT(INT_REG_OFFSET, 2U),               /*!< IRC64M stabilization interrupt flag */
    RCU_INT_FLAG_HXTALSTB       = RCU_REGIDX_BIT(INT_REG_OFFSET, 3U),               /*!< HXTAL stabilization interrupt flag */
    RCU_INT_FLAG_PLL0STB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 4U),               /*!< PLL0 stabilization interrupt flag */
    RCU_INT_FLAG_PLL1STB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 5U),               /*!< PLL1 stabilization interrupt flag */
    RCU_INT_FLAG_PLL2STB        = RCU_REGIDX_BIT(INT_REG_OFFSET, 6U),               /*!< PLL2 stabilization interrupt flag */
    RCU_INT_FLAG_CKM            = RCU_REGIDX_BIT(INT_REG_OFFSET, 7U),               /*!< HXTAL clock stuck interrupt flag */
    RCU_INT_FLAG_LCKM           = RCU_REGIDX_BIT(INT_REG_OFFSET, 27U),              /*!< LXTAL clock stuck interrupt flag */
    RCU_INT_FLAG_LPIRC4MSTB     = RCU_REGIDX_BIT(INT_REG_OFFSET, 24U),              /*!< LPIRC4M stabilization interrupt flag */
    RCU_INT_FLAG_IRC48MSTB      = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 6U),            /*!< IRC48M stabilization interrupt flag */
    RCU_INT_FLAG_PLLUSBHS0STB   = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 4U),            /*!< PLLUSBHS0 stabilization interrupt flag */
    RCU_INT_FLAG_PLLUSBHS1STB   = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 5U)             /*!< PLLUSBHS1 stabilization interrupt flag */
} rcu_int_flag_enum;

/* clock stabilization and stuck interrupt flags clear */
typedef enum {
    RCU_INT_FLAG_IRC32KSTB_CLR      = RCU_REGIDX_BIT(INT_REG_OFFSET, 16U),          /*!< IRC32K stabilization interrupt flags clear */
    RCU_INT_FLAG_LXTALSTB_CLR       = RCU_REGIDX_BIT(INT_REG_OFFSET, 17U),          /*!< LXTAL stabilization interrupt flags clear */
    RCU_INT_FLAG_IRC64MSTB_CLR      = RCU_REGIDX_BIT(INT_REG_OFFSET, 18U),          /*!< IRC64M stabilization interrupt flags clear */
    RCU_INT_FLAG_HXTALSTB_CLR       = RCU_REGIDX_BIT(INT_REG_OFFSET, 19U),          /*!< HXTAL stabilization interrupt flags clear */
    RCU_INT_FLAG_PLL0STB_CLR        = RCU_REGIDX_BIT(INT_REG_OFFSET, 20U),          /*!< PLL0 stabilization interrupt flags clear */
    RCU_INT_FLAG_PLL1STB_CLR        = RCU_REGIDX_BIT(INT_REG_OFFSET, 21U),          /*!< PLL1 stabilization interrupt flags clear */
    RCU_INT_FLAG_PLL2STB_CLR        = RCU_REGIDX_BIT(INT_REG_OFFSET, 22U),          /*!< PLL2 stabilization interrupt flags clear */
    RCU_INT_FLAG_CKM_CLR            = RCU_REGIDX_BIT(INT_REG_OFFSET, 23U),          /*!< HXTAL clock stuck interrupt flags clear */
    RCU_INT_FLAG_LCKM_CLR           = RCU_REGIDX_BIT(INT_REG_OFFSET, 28U),          /*!< LXTAL clock stuck interrupt flags clear */
    RCU_INT_FLAG_LPIRC4MSTB_CLR     = RCU_REGIDX_BIT(INT_REG_OFFSET, 26U),          /*!< LPIRC4M  stabilization interrupt flag clear */
    RCU_INT_FLAG_IRC48MSTB_CLR      = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 22U),       /*!< IRC48M stabilization interrupt flag clear */
    RCU_INT_FLAG_PLLUSBHS0STB_CLR   = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 20U),       /*!< PLLUSBHS0 stabilization interrupt flag clear */
    RCU_INT_FLAG_PLLUSBHS1STB_CLR   = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 21U)        /*!< PLLUSBHS1 stabilization interrupt flag clear */
} rcu_int_flag_clear_enum;

/* clock stabilization interrupt enable or disable */
typedef enum {
    RCU_INT_IRC32KSTB               = RCU_REGIDX_BIT(INT_REG_OFFSET, 8U),           /*!< IRC32K stabilization interrupt */
    RCU_INT_LXTALSTB                = RCU_REGIDX_BIT(INT_REG_OFFSET, 9U),           /*!< LXTAL stabilization interrupt */
    RCU_INT_IRC64MSTB               = RCU_REGIDX_BIT(INT_REG_OFFSET, 10U),          /*!< IRC64M stabilization interrupt */
    RCU_INT_HXTALSTB                = RCU_REGIDX_BIT(INT_REG_OFFSET, 11U),          /*!< HXTAL stabilization interrupt */
    RCU_INT_PLL0STB                 = RCU_REGIDX_BIT(INT_REG_OFFSET, 12U),          /*!< PLL0 stabilization interrupt */
    RCU_INT_PLL1STB                 = RCU_REGIDX_BIT(INT_REG_OFFSET, 13U),          /*!< PLL1 stabilization interrupt */
    RCU_INT_PLL2STB                 = RCU_REGIDX_BIT(INT_REG_OFFSET, 14U),          /*!< PLL2 stabilization interrupt */
    RCU_INT_IRC48MSTB               = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 14U),       /*!< internal 48 MHz RC oscillator stabilization interrupt */
    RCU_INT_LPIRC4MSTB              = RCU_REGIDX_BIT(INT_REG_OFFSET, 25U),          /*!< LPIRC4M stabilization interrupt */
    RCU_INT_PLLUSBHS0STB            = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 12U),       /*!< PLLUSBHS0 stabilization interrupt */
    RCU_INT_PLLUSBHS1STB            = RCU_REGIDX_BIT(ADDINT_REG_OFFSET, 13U)        /*!< PLLUSBHS1 stabilization interrupt */
} rcu_int_enum;

/* oscillator types */
typedef enum {
    RCU_HXTAL                       = RCU_REGIDX_BIT(CTL_REG_OFFSET, 16U),          /*!< HXTAL */
    RCU_LXTAL                       = RCU_REGIDX_BIT(BDCTL_REG_OFFSET, 0U),         /*!< LXTAL */
    RCU_IRC64M                      = RCU_REGIDX_BIT(CTL_REG_OFFSET, 30U),          /*!< IRC64M */
    RCU_IRC48M                      = RCU_REGIDX_BIT(ADDCTL0_REG_OFFSET, 16U),      /*!< IRC48M */
    RCU_IRC32K                      = RCU_REGIDX_BIT(RSTSCK_REG_OFFSET, 0U),        /*!< IRC32K */
    RCU_LPIRC4M                     = RCU_REGIDX_BIT(ADDCTL1_REG_OFFSET, 0U),       /*!< LPIRC4M */
    RCU_PLL0_CK                     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 24U),          /*!< PLL0 */
    RCU_PLL1_CK                     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 26U),          /*!< PLL1 */
    RCU_PLL2_CK                     = RCU_REGIDX_BIT(CTL_REG_OFFSET, 28U),          /*!< PLL2 */
    RCU_PLLUSBHS0_CK                = RCU_REGIDX_BIT(ADDCTL1_REG_OFFSET, 28U),      /*!< PLLUSBHS0 */
    RCU_PLLUSBHS1_CK                = RCU_REGIDX_BIT(ADDCTL1_REG_OFFSET, 30U)       /*!< PLLUSBHS1 */
} rcu_osci_type_enum;

/* rcu clock frequency */
typedef enum {
    CK_SYS = 0U,                                                                    /*!< system clock */
    CK_AHB,                                                                         /*!< AHB clock */
    CK_APB1,                                                                        /*!< APB1 clock */
    CK_APB2,                                                                        /*!< APB2 clock */
    CK_APB3,                                                                        /*!< APB3 clock */
    CK_APB4,                                                                        /*!< APB4 clock */
    CK_PLL0P,                                                                       /*!< PLL0P clock */
    CK_PLL0Q,                                                                       /*!< PLL0Q clock */
    CK_PLL0R,                                                                       /*!< PLL0R clock */
    CK_PLL1P,                                                                       /*!< PLL1P clock */
    CK_PLL1Q,                                                                       /*!< PLL1Q clock */
    CK_PLL1R,                                                                       /*!< PLL1R clock */
    CK_PLL2P,                                                                       /*!< PLL2P clock */
    CK_PLL2Q,                                                                       /*!< PLL2Q clock */
    CK_PLL2R,                                                                       /*!< PLL2R clock */
    CK_PER,                                                                         /*!< PER clock */
    CK_USART0,                                                                      /*!< USART0 clock */
    CK_USART1,                                                                      /*!< USART1 clock */
    CK_USART2,                                                                      /*!< USART2 clock */
    CK_USART5,                                                                      /*!< USART5 clock */
    CK_IRC64MDIV,                                                                   /*!< IRC64MDIV clock */
    CK_HXTAL,                                                                       /*!< HXTAL clock */
    CK_LPIRC4M                                                                      /*!< LPIRC4M clock */
} rcu_clock_freq_enum;

