RT-Thread/rt-thread/bsp/gd32/arm/libraries/GD32H7xx_Firmware_Library/GD32H7xx_standard_peripheral/Include/gd32h7xx_rcu.h
typedef enum {
    IDX_USART0 = 0U,                                                                /*!< idnex of USART0 */
    IDX_USART1,                                                                     /*!< idnex of USART1 */
    IDX_USART2,                                                                     /*!< idnex of USART2 */
    IDX_USART5                                                                      /*!< idnex of USART5 */
} usart_idx_enum;

typedef enum {
    IDX_I2C0 = 0U,                                                                  /*!< idnex of I2C0 */
    IDX_I2C1,                                                                       /*!< idnex of I2C1 */
    IDX_I2C2,                                                                       /*!< idnex of I2C2 */
    IDX_I2C3,                                                                       /*!< idnex of I2C2 */
} i2c_idx_enum;

typedef enum {
    IDX_CAN0 = 0U,                                                                  /*!< idnex of CAN0 */
    IDX_CAN1,                                                                       /*!< idnex of CAN1 */
    IDX_CAN2,                                                                       /*!< idnex of CAN2 */
} can_idx_enum;

typedef enum {
    IDX_SAI0 = 0U,                                                                  /*!< idnex of SAI0 */
    IDX_SAI1                                                                        /*!< idnex of SAI1 */
} sai_idx_enum;

typedef enum {
    IDX_SAI2B0 = 0U,                                                                /*!< idnex of SAI2B0 */
    IDX_SAI2B1                                                                      /*!< idnex of SAI2B1 */
} sai2b_idx_enum;

typedef enum {
    IDX_ADC0 = 0U,                                                                  /*!< idnex of ADC0 */
    IDX_ADC1,                                                                       /*!< idnex of ADC1 */
    IDX_ADC2                                                                        /*!< idnex of ADC2 */
} adc_idx_enum;

typedef enum {
    IDX_USBHS0 = 0U,                                                                /*!< idnex of USBHS0 */
    IDX_USBHS1                                                                      /*!< idnex of USBHS1 */
} usbhs_idx_enum;

typedef enum {
    IDX_PLL0 = 0U,                                                                  /*!< idnex of PLL0 */
    IDX_PLL1,                                                                       /*!< idnex of PLL1 */
    IDX_PLL2                                                                        /*!< idnex of PLL2 */
} pll_idx_enum;

typedef enum {
    IDX_SDIO0 = 0U,                                                                 /*!< idnex of SDIO0 */
    IDX_SDIO1                                                                       /*!< idnex of SDIO1 */
} sdio_idx_enum;

typedef enum {
    IDX_SPI0 = 0U,                                                                  /*!< idnex of SPI0 */
    IDX_SPI1,                                                                       /*!< idnex of SPI1 */
    IDX_SPI2,                                                                       /*!< idnex of SPI2 */
    IDX_SPI3,                                                                       /*!< idnex of SPI3 */
    IDX_SPI4,                                                                       /*!< idnex of SPI4 */
    IDX_SPI5                                                                        /*!< idnex of SPI5 */
} spi_idx_enum;

/* RCU_PLLADDCTL register bit define */
/* PLLs P/Q/R divider output enable */
#define RCU_PLL0P                 RCU_PLLADDCTL_PLL0PEN                             /*!< PLL0P divider output enable */
#define RCU_PLL0Q                 RCU_PLLADDCTL_PLL0QEN                             /*!< PLL0Q divider output enable */
#define RCU_PLL0R                 RCU_PLLADDCTL_PLL0REN                             /*!< PLL0R divider output enable */
#define RCU_PLL1P                 RCU_PLLADDCTL_PLL1PEN                             /*!< PLL1P divider output enable */
#define RCU_PLL1Q                 RCU_PLLADDCTL_PLL1QEN                             /*!< PLL1Q divider output enable */
#define RCU_PLL1R                 RCU_PLLADDCTL_PLL1REN                             /*!< PLL1R divider output enable */
#define RCU_PLL2P                 RCU_PLLADDCTL_PLL2PEN                             /*!< PLL2P divider output enable */
#define RCU_PLL2Q                 RCU_PLLADDCTL_PLL2QEN                             /*!< PLL2Q divider output enable */
#define RCU_PLL2R                 RCU_PLLADDCTL_PLL2REN                             /*!< PLL2R divider output enable */

/* RCU_CFG0 register bit define */
/* USARTx(x=0,1,2,5) clock source selection */
#define CFG1_USART0SEL(regval)       (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_USARTSRC_APB             CFG1_USART0SEL(0)                              /*!< CK_USART select CK_APB */
#define RCU_USARTSRC_AHB             CFG1_USART0SEL(1)                              /*!< CK_USART select CK_AHB */
#define RCU_USARTSRC_LXTAL           CFG1_USART0SEL(2)                              /*!< CK_USART select CK_LXTAL */
#define RCU_USARTSRC_IRC64MDIV       CFG1_USART0SEL(3)                              /*!< CK_USART select CK_IRC16MDIV */

/* I2Cx(x=0,1,2,3) clock source selection */
#define CFG3_I2C1SEL(regval)         (BITS(0,1) & ((uint32_t)(regval) << 0U))
#define RCU_I2CSRC_APB1              CFG3_I2C1SEL(0)                                /*!< CK_I2C select CK_APB1 */
#define RCU_I2CSRC_PLL2R             CFG3_I2C1SEL(1)                                /*!< CK_I2C select CK_PLL2R */
#define RCU_I2CSRC_IRC64MDIV         CFG3_I2C1SEL(2)                                /*!< CK_I2C select CK_IRC64MDIV */
#define RCU_I2CSRC_LPIRC4M           CFG3_I2C1SEL(3)                                /*!< CK_I2C select CK_LPIRC4M */

